Autodesk.Revit.DB.DiameterDimensionGeometryOptions.Create(Autodesk.Revit.DB.View,Autodesk.Revit.DB.DimensionType,Autodesk.Revit.DB.Arc,Autodesk.Revit.DB.XYZ)
Creates an instance of Autodesk.Revit.DB.DiameterDimensionGeometryOptions with the specified parameters.
view:
The view whose properties will be used to compute the dimension geometry.
dimensionType:
The Autodesk.Revit.DB.DimensionType of the dimension.
arc:
The arc to which the dimension is to be bound.
origin:
The point where the witness line of the radial dimension will lie.
Returns:
Returns an instance of Autodesk.Revit.DB.DiameterDimensionGeometryOptions with the specified parameters.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input point lies outside of Revit design limits.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.DiameterDimensionGeometryOptions
A class that encapsulates the options needed to create the Diameter Dimension geometry.